Data/SimulationFiles/K43_Re12982/BaseModel/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../config"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omega0;

boundaryField
{
    inlet
    {
        type cyclic;
        //type            turbulentMixingLengthFrequencyInlet;
		//mixingLength	0.0028;
        //value           $internalField;
    }
    outlet
    {
        type cyclic;
        //type            zeroGradient;
    }
    fixedWalls-top
    {
        type symmetry;
        //type            omegaWallFunction;
        //value           $internalField;
    }
    fixedWalls-bottom
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
